In [1]:
import numpy as np
import pandas as pd

In [6]:
df=pd.DataFrame({'scores':[23,100,67],'age':[12,34,1]},index=['a','b','c'])

In [7]:
df.mean()

scores    63.333333
age       15.666667
dtype: float64

In [8]:
df

   scores  age
a      23   12
b     100   34
c      67    1

In [9]:
df.loc['a','scores']

23

In [10]:
df.loc['a','scores']=np.nan

In [11]:
df

   scores  age
a     NaN   12
b   100.0   34
c    67.0    1

In [12]:
df.mean()#自动跳过缺失的值，按照列做平均数

scores    83.500000
age       15.666667
dtype: float64

In [13]:
df.mean(axis=1)#按行求平均数

a    12.0
b    67.0
c    34.0
dtype: float64

In [14]:
df.sum()#按列求和

scores    167.0
age        47.0
dtype: float64

In [15]:
df

   scores  age
a     NaN   12
b   100.0   34
c    67.0    1

In [16]:
df.sort_values(by='age')#按照age进行排序,默认为升序

   scores  age
c    67.0    1
a     NaN   12
b   100.0   34

In [17]:
df.sort_values(by='age',ascending=False)

   scores  age
b   100.0   34
a     NaN   12
c    67.0    1

In [18]:
df.sort_values(by='scores')#nan默认放在最后面

   scores  age
c    67.0    1
b   100.0   34
a     NaN   12

In [24]:
df.sort_values(by='scores',ascending=False)

   scores  age
b   100.0   34
c    67.0    1
a     NaN   12

In [25]:
df.sort_index()#按照指标排序

   scores  age
a     NaN   12
b   100.0   34
c    67.0    1

In [26]:
df

   scores  age
a     NaN   12
b   100.0   34
c    67.0    1

In [2]:
df=pd.DataFrame({'Mary':[1,2],'H':[3,9]})

In [3]:
df

   Mary  H
0     1  3
1     2  9

In [11]:
df.sort_values(by='Mary',ascending=False)

   Mary  H
1     2  9
0     1  3